/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstnew.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjiki <hyunjiki@student.42gyeongsa      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/03/18 18:11:48 by hyunjiki          #+#    #+#             */
/*   Updated: 2024/03/18 18:50:46 by hyunjiki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

t_list	*ft_lstnew(void *content)
{
}

// malloc을 사용하여 새 노드를 할당하고 반환
// content값으로 요소 초기화,  next 변수는 NULL로 초기화

// content: 새로운 요소를 생성하는 데 사용할 content
// 반환값: 새 요소
