/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjiki <hyunjiki@student.42gyeongsa      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/03/14 19:25:51 by hyunjiki          #+#    #+#             */
/*   Updated: 2024/03/14 23:01:19 by hyunjiki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
#include <stddef.h>

void	ft_striteri(char *s, void (*f)(unsigned int, char *))
{
	size_t	i;

	i = 0;
	if (!s || !f)
		return ;
	while (s[i])
	{
		f(i, &s[i]);
		i++;
	}
}

// 인수로 전달된 문자열의 각 문자에 'f' 함수를 적용하고 해당 인덱스를 첫 번째 인수로 전달
// 각 문자는 필요한 경우 수정되도록 'f'의 주소로 전달

// s: 반복할 문자열
// f: 각 문자에 적용할 함수
// 반환값: 없음
